Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་དེ་ལྟར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་ལེགས་སོ་ལེགས་སོ། །རིགས་ཀྱི་བུ་གང་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་དེ་ནི། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་གདུང་མི་གཅད་པའི་ཕྱིར་ཞུགས་པ་ཡིན་ནོ། །འདོད་ཆགས་དང་བྲལ་བའི་རིགས་ཡང་དག་པ་ཅི་ལྟ་བ་བཞིན་དུ་རྣམ་པར་རིག་པར་བྱ་བ་ལ་བརྩོན་པ་ཡིན། ཞིང་གི་རྒྱུད་ཐམས་ཅད་ཡོངས་སུ་དག་པར་བྱ་བ་ལ་ཞུགས་པ་ཡིན། སེམས་ཅན་གྱི་རིགས་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། འདུལ་བ་ལ་སྟ་གོན་དུ་གནས་པ་ཡིན། ཆོས་ཀྱི་རིགས་ཐམས་ཅད་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་བརྟག་པ་ལ་བརྩོན་པ་ཡིན། ལས་ཀྱི་རིགས་ཐམས་ཅད་དང་མི་འགལ་བར་གནས་པ་ཡིན། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་རིགས་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱ་བ་ལ་རབ་ཏུ་བརྩོན་པ་ཡིན། སྨོན་ལམ་གྱི་རིགས་ཐམས་ཅད་རྒྱུན་མི་འཆད་པའི་ཕྱིར་ཡང་དག་པར་ཞུགས་པ་ཡིན། དུས་གསུམ་གྱི་རྒྱུད་ཐམས་ཅད་ཡེ་ཤེས་ཀྱི་ཁོང་དུ་ཆུད་པར་བྱ་བ་ལ་ཞུགས་པ་ཡིན། མོས་པའི་རིགས་ཤིན་ཏུ་བརྟན་པར་བྱ་བའི་ཕྱིར་བརྩོན་པ་ཡིན་ཏེ། དེ་ནི་དེ་བཞིན་གཤེགས་པ་མང་པོ་ཐམས་ཅད་ཀྱི་བྱིན་གྱིས་བརླབས་པ་ཡིན། སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་ཡང་དག་པར་དགོངས་པ་ཡིན།
en: He said to Sudhana, the head merchant’s son, “Noble one, it is excellent, excellent, that you have developed the aspiration for the highest, complete enlightenment and that you have an unceasing dedication to the lineage of all the buddhas, you are dedicated to correctly imparting knowledge of the lineage of freedom from desire, you practice the purification of the classes of realms, you are prepared for ripening and guiding all classes of beings, you are dedicated to correctly examining all the traditions of the Dharma, you maintain a state of not contravening all the classes of karma, you are dedicated to perfecting the classes of bodhisattva conduct, you correctly engage in a continuity of all classes of prayers, you engage in comprehending through wisdom all the classes of three times, and you are dedicated to making firm the classes of motivations.

source: བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་དང་མཉམ་པ་ཉིད་དུ་གྱུར་པ་ཡིན། འཕགས་པ་ཐམས་ཅད་ཀྱི་རྗེས་སུ་དགྱེས་པར་བྱ་བ་ཡིན། ཚངས་པའི་དབང་པོ་ཐམས་ཅད་ཀྱིས་མངོན་པར་དགའ་བར་བྱས་པ་ཡིན། ལྷའི་དབང་པོ་ཐམས་ཅད་ཀྱིས་ཡང་དག་པར་མཆོད་པ་ཡིན། གནོད་སྦྱིན་གྱི་དབང་པོ་ཐམས་ཅད་ཀྱིས་ཡོངས་སུ་བསྲུང་བ་ཡིན། སྲིན་པོའི་དབང་པོ་ཐམས་ཅད་ཀྱིས་རིམ་གྲོར་བྱས་པ་ཡིན། ཀླུའི་དབང་པོ་ཐམས་ཅད་ཀྱིས་བསུ་བ་ཡིན།
en: “That is the blessing of all the many tathāgatas, that is the intention of all the buddhas, that is the attainment of equality of all the bodhisattvas, that is what all the āryas rejoice in, that is what delights all the Brahmakāyika lords, that is what is offered to by all the deva lords, that is what is protected by all the yakṣa lords, that is what is honored by all the rākṣasa lords, that is what is welcomed by all the nāga lords, that is what is praised by all the kinnara lords, and that is what is praised by all the lords of the world.

source: མིའམ་ཅིའི་དབང་པོ་ཐམས་ཅད་ཀྱིས་མངོན་པར་བསྟོད་པ་ཡིན། འཇིག་རྟེན་གྱི་དབང་པོ་ཐམས་ཅད་ཀྱིས་ཡང་དག་པར་བསྔགས་པ་ཡིན། དེས་ནི་སེམས་ཅན་གྱི་ཁམས་ཐམས་ཅད་ཀྱང་ངན་སོང་གི་ལམ་རྒྱུད་གསུམ་པོ་ཡོངས་སུ་གཅད་པ་དང་མི་ཁོམ་པ་དང་།
en: “It is what prevents the entire realm of beings from being reborn in the three lower existences and turns them away from all paths to unfortunate and lower existences.

source: ངན་འགྲོ་ལམ་ཐམས་ཅད་བཟློག་པ་དང་། དབུལ་བའི་ལམ་ཐམས་ཅད་ལས་ཡང་དག་པར་བཟླ་བ་དང་།
en: It turns them away from the paths that lead to poverty.

source: ལྷ་དང་མིའི་ཕུན་སུམ་ཚོགས་པ་ཐོབ་པར་བྱ་བ་དང་། དགེ་བའི་བཤེས་གཉེན་མཐོང་བ་དང་མི་འབྲལ་བ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་རྒྱ་ཆེན་པོ་མཉམ་པ་དང་། འབྲལ་བར་མི་འགྱུར་བ་དང་། བྱང་ཆུབ་ཀྱི་སེམས་ཀྱི་ཡན་ལག་ཡོངས་སུ་དག་པར་བྱ་བ་དང་། བྱང་ཆུབ་ཀྱི་སེམས་འབྱུང་བའི་རྒྱུད་ཡོངས་སུ་བསྒྲུབ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ལམ་སྣང་བ་ཐོབ་པར་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཡེ་ཤེས་ཁོང་བུ་ཆུད་པར་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ས་ལ་གནས་པར་བྱ་བས་དབུགས་ཕྱིན་པར་བྱས་པ་ཡིན། རིགས་ཀྱི་བུ་དེ་ལ་བདག་འདི་སྙམ་དུ་སེམས་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་དཀའ་བ་བྱེད་པ་སྟེ། འབྱུང་བར་དཀའ་ཞིང་མཐོང་བར་དཀའ་བའོ། །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་སེམས་ཅན་རྣམས་ལ་བག་དྲོ་བར་བྱེད་པས་ཕ་དང་མ་ལྟ་བུའོ། །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་གྱི་རྒྱན་ཏུ་གྱུར་པའོ། །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་སྡུག་བསྔལ་གྱིས་མནར་བ་རྣམས་ལ་སྐྱབས་སུ་གྱུར་པའོ། །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་བསྲུང་བའི་ཕྱིར་གནས་སུ་གྱུར་པའོ། །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་འཇིགས་པ་སྣ་ཚོགས་ཀྱིས་གཙེས་པ་རྣམས་ལ་དཔུང་གཉེན་དུ་གྱུར་པའོ། །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་འགྲོ་བ་ཐམས་ཅད་ངན་སོང་གསུམ་དུ་ལྟུང་བ་ལས་ཡོངས་སུ་རྟོན་པའི་ཕྱིར་རླུང་གི་དཀྱིལ་འཁོར་ལྟ་བུའོ། །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དགེ་བའི་རྩ་བ་རྣམ་པར་འཕེལ་བར་བྱེད་པས་ས་ལྟ་བུའོ། །
en: It brings the attainment of the good fortune of devas and humans.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་བསོད་ནམས་རིན་པོ་ཆེའི་མཛོད་མི་ཟད་པའི་གཏོས་དང་ལྡན་པས་རྒྱ་མཚོ་ལྟ་བུའོ། །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་ཡེ་ཤེས་ཀྱི་འོད་ཀྱིས་སྣང་བར་བྱེད་པའི་ཕྱིར་ཉི་མ་ལྟ་བུའོ། །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་དགེ་བའི་རྩ་བས་ཤིན་ཏུ་མཐོ་བས་རི་རབ་ལྟ་བུའོ། །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་སྙིང་པོ་བྱང་ཆུབ་ཏུ་ཡེ་ཤེས་ཀྱི་ཟླ་བ་འཆར་བར་འགྱུར་བའི་ཕྱིར་ཟླ་བ་ལྟ་བུའོ། །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་བདུད་ཀྱི་སྡེ་ཐམས་ཅད་རབ་ཏུ་འཇོམས་པས་དཔའ་བོར་གྱུར་པའོ། །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་རང་བྱུང་གི་ཆོས་ཀྱི་གྲོང་ཁྱེར་དུ་ཕྱིན་པར་བྱེད་པས་རྟུལ་ཕོད་པ་ལྟ་བུའོ། །
en: “Through it there will be no separation from seeing the kalyāṇamitra, no separation from the vast ocean of the Buddhadharma; it purifies the aspiration for enlightenment, it accomplishes the cause of the aspiration for enlightenment, it obtains the illumination of the bodhisattva path, it brings the realization of bodhisattva wisdom, and it brings the relief of being on the level of a bodhisattva.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་བག་ལ་བྱམས་པའི་རླན་ཡོངས་སུ་སྐེམ་པས་མེ་ལྟ་བུའོ། །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་ཆོས་ཀྱི་སྤྲིན་རྒྱ་ཆེན་པོའི་ཆར་མངོན་པར་འབེབས་པས་སྤྲིན་ལྟ་བུའོ། །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་སེམས་ཅན་གྱི་དབང་པོ་དད་པ་ལ་སྩོགས་པའི་མྱུ་གུ་རྣམ་པར་འཕེལ་བར་བྱེད་པས་ཆར་པ་ལྟ་བུའོ། །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་ཆོས་རྒྱ་མཚོའི་འགྲམ་ཡོངས་སུ་སྟོན་པས་མཉན་པ་ལྟ་བུའོ། །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་སེམས་ཅན་ཐམས་ཅད་འཁོར་བའི་རྒྱ་མཚོ་ལས་ཡང་དག་པར་སྒྲོལ་བའི་ཕྱིར་ཟམ་པ་ལྟ་བུའོ། །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་མངོན་པར་བགྲོད་པར་བྱ་བའི་ཕྱིར་མུ་སྟེགས་ལྟ་བུའོ། །
en: “Noble one, this is what I think: the bodhisattvas accomplish what is difficult, they are the manifestation of a sight that is difficult to obtain, and they are a comfort to the world; the bodhisattvas are like fathers and mothers to all beings; the bodhisattvas are like adornments for this world and its paradises; the bodhisattvas save beings from the torments of suffering; the bodhisattvas remain in order to protect all beings; the bodhisattvas are a refuge from the misfortune of various kinds of danger; the bodhisattvas are like the disk of air because it prevents beings from falling into the lower existences; the bodhisattvas are like the earth because they increase the roots of merit of all beings; the bodhisattvas are like the ocean because they contain an inexhaustible treasure of precious merit; the bodhisattvas are like the sun because they shine with the light of wisdom; the bodhisattvas are like Sumeru because of the great height of their roots of merit; the bodhisattvas are like the moon because they rise as the moon of the wisdom of the essence of enlightenment; the bodhisattvas are like warriors because they defeat the armies of the māras; the bodhisattvas are like heroes because they reach the self-arisen city of the Dharma; the bodhisattvas are like Agni because they dry up the wetness of the self-love of all beings; the bodhisattvas are like clouds because they send down rain from the vast cloud of the Dharma; the bodhisattvas are like rain because they increase the sprouts of the faculties, faith, and so on of beings; the bodhisattvas are like mariners because they reveal the point of embarkation for crossing the ocean of the Dharma; the bodhisattvas are like a bridge because they enable all beings to cross over the ocean of saṃsāra; and the bodhisattvas are like fords because they enable beings to cross over.”

source: དེ་ལྟར་དྲ་བྱི་ལའི་སྤྲིན་གྱིས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱི་མདུན་དུ་འདུག་སྟེ། ཚིག་གི་རྒྱུད་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་ཡོངས་སུ་བསྔགས་པ་བྱས་ནས། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་ལེགས་སོ་ཞེས་བསྔགས་སོ། །
en: In that way, Megha the Dravidian, while sitting before Sudhana, the head merchant’s son, praised the bodhisattvas with those words and congratulated Sudhana, the head merchant’s son.

source: དེ་ལྟར་དེ་བྱང་ཆུབ་སེམས་དཔའ་ཡང་དག་པར་དགའ་བར་བྱ་བའི་ཕྱིར་ཚིག་བརྗོད་པའི་ཚེ། ཁའི་སྒོ་ནས་འོད་འཕྲོ་བའི་ཕུང་པོ་རྣམ་པ་འདི་ལྟ་བུ་བྱུང་སྟེ། འོད་འཕྲོ་བའི་ཕུང་པོ་དེས་སྟོང་གསུམ་གྱི་འཇིག་རྟེན་གྱི་ཁམས་རྒྱས་པར་གང་བར་གྱུར་ནས། ལྷ་དང་ལྷ་རྫུ་འཕྲུལ་ཆེན་པོའམ། ཀླུ་དང་ཀླུ་རྫུ་འཕྲུལ་ཆེན་པོ་འམ། གནོད་སྦྱིན་དང་གནོད་སྦྱིན་རྫུ་འཕྲུལ་ཆེན་པོའམ། དྲི་ཟ་དང་དྲི་ཟ་རྫུ་འཕྲུལ་ཆེན་པོའམ།
en: As he was proclaiming those words that brought delight to bodhisattvas, a mass of light rays was emitted from his mouth in this fashion: that mass of light rays spread throughout the billion worlds.

source: ལྷ་མ་ཡིན་དང་ལྷ་མ་ཡིན་རྫུ་འཕྲུལ་ཆེན་པོའམ། ནམ་མཁའ་ལྡིང་དང་ནམ་མཁའ་ལྡིང་རྫུ་འཕྲུལ་ཆེན་པོའམ། མིའམ་ཅི་དང་མིའམ་ཅི་རྫུ་འཕྲུལ་ཆེན་པོའམ། ལྟོ་འཕྱེ་ཆེན་པོ་དང་ལྟོ་འཕྱེ་ཆེན་པོ་རྫུ་འཕྲུལ་ཆེན་པོའམ། མི་དང་མི་རྫུ་འཕྲུལ་ཆེན་པོའམ། མི་མ་ཡིན་པ་དང་མི་མ་ཡིན་པ་རྫུ་འཕྲུལ་ཆེན་པོའམ། ཚངས་པ་དང་ཚངས་པ་རྫུ་འཕྲུལ་ཆེན་པོའམ། སེམས་ཅན་གང་སུས་མཐོང་ཡང་རུང་སྟེ། སྣང་བ་དེས་ཡོངས་སུ་སྣང་བར་བྱས་པ་དེ་དག་དྲ་བྱི་ལ་སྤྲིན་གྱི་དྲུང་དུ་འོངས་སོ། །
en: Those beings who saw it and were illuminated by that great radiance—devas and devas with great miraculous power, nāgas and nāgas with great miraculous power, yakṣas and yakṣas with great miraculous power, gandharvas and gandharvas with great miraculous power, asuras and asuras with great miraculous power, garuḍas and garuḍas with great miraculous power, kinnaras and kinnaras with great miraculous power, mahoragas and mahoragas with great miraculous power, humans and humans with great miraculous power, nonhumans and nonhumans with great miraculous power, Brahmakāyikas and Brahmakāyikas with great miraculous power—came into the presence of Megha the Dravidian.

source: དེ་ནས་དེ་ལྟར་དྲ་བྱི་ལ་སྤྲིན་གྱིས་བསམ་པ་བྱིན་གྱིས་བརླབས་ཤིང་ཐལ་མོ་སྦྱར་ཏེ།
en: Their thoughts were thus blessed by Megha the Dravidian, and they placed their palms together in homage.

source: གནས་པ་ལུས་དང་སེམས་སིམ་པར་གྱུར་པ། དགའ་བ་རྒྱ་ཆེན་པོ་སྐྱེས་པ། སྲི་ཞུ་ཆེན་པོ་ལ་གནས་པ། ང་རྒྱལ་གྱི་རྒྱལ་མཚན་བཅོམ་པ། གཡོ་རྒྱུ་དང་བྲལ་བ།
en: Their bodies and minds were refreshed, they felt vast joy, they showed great veneration, they had cast down the banner of pride, they were free of deceit, and their senses were serene.

source: དབང་པོ་རྣམ་པར་དང་བར་གྱུར་པ་དེ་དག་ལ་དྲ་བྱི་ལའི་སྤྲིན་གྱིས་ཆོས་ཀྱི་རྣམ་གྲངས་ཡི་གེའི་འཁོར་ལོའི་རྒྱུད་ཀྱི་རྒྱན་ཅེས་བྱ་བ་དེ་ཉིད་རྒྱ་ཆེར་ཡང་དག་པར་བསྟན་ཏེ།
en: Megha the Dravidian taught them extensively the Dharma teaching called The Display of the Rotating Wheel of Syllables.

source: ཁོང་དུ་ཆུད་པ་དང་རྟོགས་པ་དང་ཤེས་པ་དང་རིག་པར་བྱས་སོ། །
en: He made it known to them, introduced them to it, led them into it, and caused them to understand it.

source: དེ་ཐོས་ནས་ཀྱང་དེ་དག་ཐམས་ཅད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཏོ། །
en: Having heard it, they all gained irreversible progress toward the highest, complete enlightenment.

source: དེ་ནས་དེའི་ཕྱིར་ཆོས་ཀྱི་སྟན་ལ་འདུག་ནས། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་ཁོ་བོ་ནི་དབྱངས་དང་ལྡན་པའི་གཟུངས་ཐོབ་པ་སྟེ།
en: Then Megha the Dravidian sat again upon the Dharma throne and said to Sudhana, the head merchant’s son, “Noble one, I have attained Sarasvatī’s power of retention.

source: དེའི་མཐུས་ཁོ་བོ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ལྷ་རྣམས་ཀྱི་ལྷའི་སྐད་ཀྱང་ཤེས་སོ། །དེ་བཞིན་དུ་ཀླུ་དང་གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་ནམ་མཁའ་ལྡིང་དང་མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། མི་དང་མི་མ་ཡིན་པ་དང་།
en: Through its power I know the divine languages of the devas in these world realms of the billion-world universe.

source: ཚངས་པ་རྣམས་ཀྱི་ཚངས་པའི་སྐད་ཀྱང་ཤེས་སོ། །ལྷ་རྣམས་ཀྱི་ལྷའི་སྐད་སྣ་ཚོགས་ཀྱང་ཤེས་སོ། །དེ་བཞིན་དུ་ཀླུ་དང་གནོད་སྦྱིན་དང་དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་ནམ་མཁའ་ལྡིང་དང་མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། མི་དང་མི་མ་ཡིན་པ་དང་།
en: In the same way, I know the languages of the nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, humans, and nonhumans and the Brahmakāyika language of the Brahmakāyika devas.

source: ཚངས་པ་རྣམས་ཀྱི་ཚངས་པའི་སྐད་སྣ་ཚོགས་ཀྱང་ཤེས་སོ། །ལྷ་རྣམས་ཀྱི་ལྷའི་སྐད་གཅིག་པ་ཡང་ཤེས་སོ། །དེ་བཞིན་དུ་ཀླུ་དང་གནོད་སྦྱིན་དང་དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་ནམ་མཁའ་ལྡིང་དང་མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་།
en: “I know the various divine languages of the devas, and similarly I know the various languages of the nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, humans, and nonhumans and the various Brahmakāyika languages of the Brahmakāyika devas.

source: མི་དང་མི་མ་ཡིན་པ་དང་། ཚངས་པ་རྣམས་ཀྱི་ཚངས་པའི་སྐད་གཅིག་པ་ཡང་ཤེས་སོ། །ལྷ་རྣམས་ཀྱི་ལྷའི་སྐད་ཐ་དད་པ་ཡང་ཤེས་སོ། །དེ་བཞིན་དུ་ཀླུ་དང་གནོད་སྦྱིན་དང་དྲི་ཟ་དང་ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་མིའམ་ཅི་དང་།
en: “I know the different divine languages of the devas, and similarly I know the different languages of the nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, humans, and nonhumans and the different Brahmakāyika languages of the Brahmakāyika devas.

source: ལྟོ་འཕྱེ་ཆེན་པོ་དང་མི་དང་མི་མ་ཡིན་པ་དང་། ཚངས་པ་རྣམས་ཀྱི་ཚངས་པའི་སྐད་ཐ་དད་པ་ཡང་ཤེས་སོ། །བྱོལ་སོང་གི་སྐྱེ་གནས་སུ་སྐྱེས་པའི་སེམས་ཅན་རྣམས་ཀྱི་བརྡ་དང་སྐད་དང་མིང་ཐ་དད་པའང་ཤེས་སོ། །
en: “I also know the different signs, languages, and names of the beings who have been reborn as animals.

source: སེམས་ཅན་དམྱལ་བ་པའི་སེམས་ཅན་རྣམས་ཀྱི་སྐད་དང་། མིང་རྣམས་ཀྱང་ཤེས་སོ། །
en: I also know the different languages and names of the beings who have been reborn in the hells.

source: གཤིན་རྗེའི་འཇིག་རྟེན་པའི་སེམས་ཅན་རྣམས་ཀྱི་སྐད་དང་མིང་རྣམས་ཀྱང་ཤེས་སོ། །
en: I also know the different languages and names of the beings in the realm of Yama.

source: འཕགས་པའི་སྐད་དང་མིང་རྣམས་ཀྱང་ཤེས་སོ། །
en: I also know the languages and names of the āryas.

source: འཕགས་པ་མ་ཡིན་པའི་སྐད་དང་མིང་རྣམས་ཤེས་སོ། །
en: I also know the languages and names of those who are not āryas.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཚིག་དང་བརྡ་དང་། ངེས་པའི་ངག་སེམས་ཅན་གྱི་བསམ་པ་བཞིན་དུ་འབྱུང་བ་ཡང་ཤེས་སོ། །
en: I also know the words, signs, and definitions of bodhisattvas that arise in accordance with the wishes of beings.

source: སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་ཡང་དུས་གསུམ་དུ་གཤེགས་པའི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་དབྱངས་ཀྱི་ཡན་ལག་དང་གསུང་རྒྱ་མཚོ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་མིང་དང་གཏམ་གྱི་སྒྲ་དང་། ཚིག་ཏུ་ལྡན་པ་ཡང་རྟོགས་ཤིང་ཁོང་དུ་ཆུད་དོ། །
en: “In each instant of mind, I perceive and comprehend the aspects of the voices and the oceans of speech of all the tathāgatas in the three times, and the words, the sound of conversations, and the languages that are used by all beings.

source: ཇི་ལྟར་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདིའི་སེམས་ཅན་རྣམས་ཀྱི་བརྡ་དང་ངེས་པའི་ཚིག་དང་སྐད་དང་མིང་རྒྱ་མཚོ་ལ་འཇུག་ཅིང་ཤེས་པ་དེ་བཞིན་དུ་ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཚད་མེད་པ། གྲངས་མེད་པ། བསམ་གྱིས་མི་ཁྱབ་པ། མཚུངས་པ་མེད་པ། ཀུན་ཏུ་མཐའ་ཡས་པ་མུ་མེད་པ། ས་མཚམས་མེད་པ་གཞལ་དུ་མེད་པ། བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པ་དང་། དེ་བཞིན་དུ་ལྷོ་ཕྱོགས་དང་། ནུབ་ཕྱོགས་དང་བྱང་ཕྱོགས་དང་། བྱང་ཤར་གྱི་ཕྱོགས་མཚམས་དང་། ཤར་ལྷོའི་ཕྱོགས་མཚམས་དང་། ལྷོ་ནུབ་ཀྱི་ཕྱོགས་མཚམས་དང་། ནུབ་བྱང་གི་ཕྱོགས་མཚམས་དང་། འོག་དང་སྟེང་གི་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཚད་མེད་པ་ནས་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་བར་གྱི་སེམས་ཅན་རྣམས་ཀྱི་བརྡ་དང་།
en: “Just as I perceive and know the ocean of terms, definitions, languages, and names of beings in this world realm of a billion worlds, in the same way, I perceive and know the ocean of terms, definitions, languages, and names of beings in a quintillion world realms, a measureless number of world realms, innumerable world realms, an inconceivable number of world realms, an unequaled number of world realms, an infinite number of world realms, limitless world realms, and an inexpressible number of world realms in the eastern direction, and it is the same for the south, the west, the north, the northeast, the southeast, the southwest, the northwest, below, and above.

source: ངེས་པའི་ཚིག་དང་སྐད་དང་མིང་རྒྱ་མཚོ་ཐམས་ཅད་ལ་འཇུག་ཅིང་ཤེས་ཏེ། འདི་ལྟར་ལྷ་རྣམས་ཀྱི་ལྷའི་སྐད་ཀྱང་ཤེས་སོ། །ཚངས་པ་རྣམས་ཀྱི་ཚངས་པའི་སྐད་ཀྱི་བར་དུའང་ཤེས་སོ། །རིགས་ཀྱི་བུ་ཁོ་བོས་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གཟུངས་སྣང་བ་དབྱངས་དང་ལྡན་པ་འདི་ཤེས་པར་ཟད་ན། ཁོ་བོས་བྱང་ཆུབ་སེམས་དཔའ་འགྲོ་བ་སྣ་ཚོགས་ཀྱི་བརྡའི་རྣམ་པ་རྒྱ་མཚོ་ལ་ཞུགས་པ་དེ་དག་དང་། འགྲོ་བ་སྣ་ཚོགས་ཀྱི་སྐད་དང་། མིང་རྒྱ་མཚོ་ལ་ཞུགས་པ་དེ་དག་དང་།
en: “In that way, I know the deva language of the devas, and so on, up to knowing the Brahmakāyika language of the Brahmakāyika devas.

source: འགྲོ་བ་སྣ་ཚོགས་ཀྱི་མིང་ཤིན་ཏུ་བསྟན་པ་མིང་རྒྱ་མཚོ་ལ་ཞུགས་པ་དེ་དག་དང་འགྲོ་བ་སྣ་ཚོགས་ཀྱི་བརྗོད་པ་རབ་ཏུ་བཀོད་པ་དང་། རྣམ་པར་སྤྱོད་པ་རྒྱ་མཚོ་ལ་ཞུགས་པ་དེ་དག་དང་། ཚིག་ཐམས་ཅད་ཀྱི་མཚམས་སྦྱར་བ་རྒྱ་མཚོ་ལ་ཞུགས་པ་དེ་དག་དང་། ཚིག་ལྷུར་བླངས་ཏེ་བསྟན་པ་རྒྱ་མཚོ་ལ་ཞུགས་པ་དེ་དག་དང་། དུས་གསུམ་གྱི་དམིགས་པ་ཐམས་ཅད་དམིགས་པ་གཅིག་ཏུ་རྣམ་པར་སྤྱོད་པ་རྒྱ་མཚོ་གང་ཆེན་མཚོ་ལ་ཞུགས་པ་དེ་དག་དང་། ཚིག་གིས་བརྩེགས་ཏེ་བསྟན་པ་རྒྱ་མཚོ་ལ་ཞུགས་པ་དེ་དག་དང་། ཚིག་གཉིས་ནས་བརྩེགས་ཏེ་བསྟན་པ་རྒྱ་མཚོ་ལ་ཞུགས་པ་དེ་དག་དང་།
en: “Noble one, I know the light of Sarasvatī’s power of retention that the bodhisattvas have, but how could I know the conduct or describe the qualities of the entry by the bodhisattvas into an ocean of different terms, their entry into an ocean of terms and languages of various beings, their entry into an ocean of taught names of various beings, their entry into an ocean of an array of descriptions by various beings, their entry into an ocean of conducts, their entry into an ocean of the conjunctions of all words, their entry into an ocean of the literal meaning of words, their entry into an ocean of single terms for perceptions that include all perceptions in the three times, their entry into an ocean of teaching through assembling a single word, their entry into an ocean of teaching through assembling two words, their entry into an ocean of teaching through dividing words, their entry into an ocean of teaching that brings guidance through categorizing the words for all phenomena, their entry into an ocean of the languages of all beings, their entry in the entire pure display of the field of speech, and what arises in the categories of the apex of the wheel of words?

source: ཚིག་རབ་ཏུ་ཕྱེ་སྟེ་བསྟན་པ་རྒྱ་མཚོ་ལ་ཞུགས་པ་དེ་དག་དང་། ཆོས་ཐམས་ཅད་རབ་ཏུ་དབྱེ་བས་འདུལ་བའི་ཚུལ་བསྟན་པ་རྒྱ་མཚོ་ལ་ཞུགས་པ་དེ་དག་དང་། འགྲོ་བ་ཐམས་ཅད་ཀྱི་སྐད་རྒྱ་མཚོ་ལ་ཞུགས་པ་དེ་དག་དང་། དབྱངས་ཀྱི་དཀྱིལ་འཁོར་རྣམ་པར་དག་པའི་རྒྱན་ཐམས་ཅད་ལ་ཞུགས་པ་དེ་དག་དང་། ཡི་གེའི་འཁོར་ལོའི་མཐར་ཕྱིན་པར་བྱ་བས་རབ་ཏུ་དབྱེ་བ་ལས་བྱུང་བ་དེ་དག་གི་སྤྱོད་པ་ཤེས་པའམ།
en: “Now depart, noble one.

source: ཡོན་ཏན་བརྗོད་པར་ནུས་རེ་སྐན། །སོང་རིགས་ཀྱི་བུ་ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་འདི་ཉིད་ན་ཡུལ་ནགས་ཚལ་ན་གནས་པ་ཞེས་བྱ་བ་ཡོད་དེ།
en: In this southern region, in the land of Vanavāsī, there dwells a head merchant by the name of Muktaka.

source: དེ་ན་ཚོང་དཔོན་བཏང་བརྗོད་ཅེས་བྱ་བ་འདུག་གི་དེའི་གན་དུ་སོང་ལ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བརྩོན་པར་བྱ་བ་དང་།
en: Go to him and ask him, ‘How should bodhisattvas train in bodhisattva conduct?

source: ཇི་ལྟར་འབྱུང་བར་བྱ་བ་དང་།
en: How should they set forth?

source: ཇི་ལྟར་སེམས་ངེས་པར་བཞག་པར་བྱ་བ་དྲིས་ཤིག །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས། དྲ་བྱི་ལ་སྤྲིན་གྱི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ།
en: How should their minds rest in meditation?’ ”

source: ཆོས་ཀྱི་རིམ་གྲོ་བྱས་ནས། དད་པའི་མཚན་ཉིད་རྩ་བ་ཚུགས་པ་ལ་རབ་ཏུ་བརྟག་པ་དང་། དགེ་བའི་བཤེས་གཉེན་ལས་འོངས་པའི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་ཡང་དག་པར་ལྟ་ཞིང་གདོང་མཆི་མས་གང་བར་ངུས་ཏེ། དྲ་བྱི་ལ་སྤྲིན་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས། ཡང་དང་ཡང་བལྟས་ཏེ་ཕྱག་འཚལ་ཞིང་དྲ་བྱི་ལ་སྤྲིན་གྱི་དྲུང་ནས་སོང་ངོ་།། །།སངས་རྒྱས་རྨད་གཅད་ཅེས་བྱ་བ་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་མདོ། བམ་པོ་ཉི་ཤུ་དགུ་པ། དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་བྱང་ཆུབ་སེམས་དཔའི་གཟུངས་སྣང་བ་དབྱངས་དང་ལྡན་པའི་རྒྱན་དེ་ཉིད་ལ་རྗེས་སུ་བསམ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྐད་ཀྱི་ཚུལ་རྒྱ་མཚོ་དེ་ཉིད་ལ་འཇུག་པར་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་ཕྲ་མོ་ལ་འཇུག་པ་དེ་ཉིད་རྗེས་སུ་དྲན་པར་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སེམས་རྣམ་པར་བྱང་བས། རྣམ་པར་དག་པ་དེ་ཉིད་ཀྱི་རྗེས་སུ་འབྲང་བར་བྱ་བ་དང་།
en: Then Sudhana, the head merchant’s son, bowed his head to the feet of Megha the Dravidian, and showing respect for his Dharma, showing that Megha was the source for the signs of the arising of his faith, and seeing the omniscience that has come from the kalyāṇamitra, weeping, with his face covered in tears, he circumambulated Megha the Dravidian a hundred thousand times, keeping him to his right, and, looking back a hundred thousand times, departed from Megha the Dravidian.

source: བྱང་ཆུབ་སེམས་དཔའི་དགེ་བའི་རྩ་བའི་བག་ཆགས་བསྡུ་ཞིང་བསྒྲུབ་པ་མངོན་པར་བསྒྲུབ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་སྒོ་དེ་ཉིད་རྣམ་པར་སྦྱང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སེམས་ཅན་བསྡུ་བའི་ཡེ་ཤེས་དེ་ཉིད་ཤིན་ཏུ་བྱང་བར་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་བསམ་པའི་སྟོབས་རྣམ་པར་དག་པ་བྱ་བ་དེ་ཉིད་བརྟན་པར་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ལྷག་པའི་བསམ་པའི་སྟོབས་དེ་ཉིད་ཉེ་བར་བརྟན་པར་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་མོས་པའི་རྒྱུད་དེ་ཉིད་ཡོངས་སུ་སྦྱང་བ་དང་།
en: Muktaka Chapter 8 Sudhana, the head merchant’s son, then contemplated that power of retention of the bodhisattvas called the light that is the display of Sarasvatī, remembered that particular entry by the bodhisattvas into an ocean of languages, remembered that particular entry by the bodhisattvas into the way of subtlety, remembered that particular purity of the bodhisattvas through purification of the mind, accomplished that particular accomplishment by the bodhisattvas of creating the predispositions for roots of merit, purified that particular bodhisattva gateway for ripening, refined that particular bodhisattva wisdom that attracts beings, made firmer that particular pure strength of bodhisattva motivation, stabilized that particular strength of the superior motivation of the bodhisattvas, purified that lineage of bodhisattva aspiration, developed that particular goodness that is in the minds of the bodhisattvas, and entered into that particular commitment of the bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའི་སེམས་དེ་ཉིད་གདོན་མི་ཟ་བར་དགེ་བར་བསམ་པ་དང་བྱང་ཆུབ་སེམས་དཔའི་ཡི་དམ་ཆེན་པོ་དེ་ཉིད་མཐར་ཕྱིན་པར་བྱེད་ཅིང་། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཡི་དམ་ལ་བརྟན་ཞིང་སྨོན་ལམ་གྱི་སེམས་ཀྱིས་ཡོངས་སུ་སྐྱོ་བ་མེད་པའི་རྒྱུད་ཀྱི་རྒྱན་དང་ལྡན་པ།
en: Sudhana, the head merchant’s son, displayed a continuity of strong commitment, a mind of aspiration, and indefatigability.

source: ཕྱིར་མི་ལྡོག་པས་རྣམ་པར་གནོན་པའི་བརྩོན་འགྲུས་ཅན།
en: He had the heroism of irreversible courage.

source: ཡིད་ཀྱིས་བརྟུལ་བ་ལས་མི་ཟློགས་པ།
en: He had the commitment of an irreversible mind.

source: དད་པ་མི་འཕྲོགས་པའི་སྟོབས་དང་ལྡན་པ།
en: He possessed the strength of unassailable faith.

source: རྡོ་རྗེ་མཐུ་བོ་ཆེ་མི་ཕྱེད་པའི་སེམས་དང་ལྡན་པ་དགེ་བའི་བཤེས་གཉེན་ཐམས་ཅད་ཀྱི་གདམས་ངག་འཐུན་པར་ལེན་པ།
en: His motivation had the indestructibility of the mighty vajra. He had acquired with reverence the instructions of all kalyāṇamitras.

source: ཤེས་རབ་ཁ་མ་བབ་པའི་ཡུལ་དང་ལྡན་པ།
en: He had an unimpaired scope of wisdom.

source: སྒོ་ཀུན་ནས་རྣམ་པར་དག་པ་ལ་མངོན་དུ་གྱུར་པ།
en: He faced the completely pure gateways.

source: ཡེ་ཤེས་རྣམ་པར་དག་པའི་སྤྱོད་ཡུལ་ཐོགས་པ་མེད་པ་ཀུན་ཏུ་ལྟ་བའི་ཡེ་ཤེས་ཀྱི་ཚུལ་སྣང་བ་དང་ལྡན་པ།
en: He possessed the unimpeded field of pure wisdom. He had the illumination of all-seeing wisdom.

source: སའི་གཟུངས་ཀུན་ནས་སྣང་བ་རབ་ཏུ་ཐོབ་པ།
en: He had attained the radiance of the retentive power of all levels.

source: ཆོས་ཀྱི་དབྱིངས་ཀྱི་གཞིའི་བྱེ་བྲག་ལ་མངོན་སུམ་དུ་གྱུར་པའི་སེམས་དང་ལྡན་པ།
en: His mind faced the separate bases of the realm of phenomena.

source: གཞི་ཀུན་ལ་རྟེན་པའི་རྒྱན་རྣམ་པར་དག་པའི་རང་བཞིན་རྣམ་པར་དམིགས་པ་གནས་པ་མེད་པ་དང་།
en: He perceived the nature of the pure display that is completely without any basis.

source: བདག་གི་མེད་པ་དང་གཉིས་སུ་མེད་པའི་སྤྱོད་ཡུལ་ལ་རབ་ཏུ་བརྩོན་པ།
en: He was devoted to the unattached, unequaled, nondual field of activity.

source: འདུ་ཤེས་ཐམས་ཅད་ལས་འདའ་བར་བྱེད་པའི་ཡེ་ཤེས་ཀྱི་སྒོ་རྣམ་པར་དག་པ།
en: He had the pure gateway of wisdom that surpasses all concepts.
